c5/src/Documents/CashTransfer/CashTransfer.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CashTransfer</name>
  <registerRecords>AccountingRegister.General</registerRecords>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountTo</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Receiver</name>
    <type>
      <types>CatalogRef.PaymentLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>Sender</name>
    <type>
      <types>CatalogRef.PaymentLocations</types>
    </type>
  </attributes>
</mdclass:Document>

c5/src/Enums/Accounts/Accounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Accounts</name>
  <enumValues>
    <name>AccountsPayable</name>
  </enumValues>
  <enumValues>
    <name>AccountsReceivable</name>
  </enumValues>
  <enumValues>
    <name>Bank</name>
  </enumValues>
  <enumValues>
    <name>Cash</name>
  </enumValues>
  <enumValues>
    <name>CostOfGoodsSold</name>
  </enumValues>
  <enumValues>
    <name>CreditCard</name>
  </enumValues>
  <enumValues>
    <name>Equity</name>
  </enumValues>
  <enumValues>
    <name>Expenses</name>
  </enumValues>
  <enumValues>
    <name>FixedAssets</name>
  </enumValues>
  <enumValues>
    <name>Income</name>
  </enumValues>
  <enumValues>
    <name>IntangibleAssets</name>
  </enumValues>
  <enumValues>
    <name>LongTermLiability</name>
  </enumValues>
  <enumValues>
    <name>NonPosting</name>
  </enumValues>
  <enumValues>
    <name>OtherCurrentAssets</name>
  </enumValues>
  <enumValues>
    <name>OtherCurrentLiability</name>
  </enumValues>
  <enumValues>
    <name>OtherExpenses</name>
  </enumValues>
  <enumValues>
    <name>OtherIncome</name>
  </enumValues>
  <enumValues>
    <name>OtherLongTermAssets</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/CashTransfer/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	InvoiceForm.SetLocalCurrency ( ThisObject );
	Constraints.ShowAccess ( ThisObject );
	Appearance.Apply ( ThisObject );

EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		fillNew ();
		InvoiceForm.SetLocalCurrency ( ThisObject );
		DocumentForm.Init ( Object );
		PaymentForm.SetRates ( Object );
		Constraints.ShowAccess ( ThisObject );
	endif;
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Rate Factor enable Object.Currency <> LocalCurrency
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillNew ()

	if ( not Parameters.CopyingValue.IsEmpty () ) then
		return;
	endif; 
	if ( Object.Sender.IsEmpty () ) then
		settings = Logins.Settings ( "Company, PaymentLocation, PaymentLocation.Class as Class" );
		Object.Company = settings.Company;
		if ( isCash ( settings.Class ) ) then
			Object.Sender = settings.PaymentLocation;
		endif; 
	else
		Object.Company = DF.Pick ( Object.Sender, "Owner" );
	endif; 
	setAccount ( Object );
	loadReceiver ();
	Object.Currency = Application.Currency ();

EndProcedure

&AtServer
Function isCash ( Class )
	
	return not ValueIsFilled ( Class )
	or Class = Enums.Accounts.Cash;
	
EndFunction 

&AtClientAtServerNoContext
Procedure setAccount ( Object )

	Object.Account = DF.Pick ( Object.Sender, "Account" );
	
EndProcedure

&AtServer
Procedure loadReceiver ()
	
	if ( Object.Receiver.IsEmpty () ) then
		return;
	endif;
	data = DF.Values ( Object.Receiver, "Owner, Class" );
	if ( data.Owner = Object.Company
		and isCash ( data.Class ) ) then
		setAccountTo ( Object );
	else
		Object.Receiver = undefined;
	endif; 
	
EndProcedure 

&AtClientAtServerNoContext
Procedure setAccountTo ( Object )
	
	Object.AccountTo = DF.Pick ( Object.Receiver, "Account" );
	
EndProcedure

&AtClient
Procedure BeforeWrite ( Cancel, WriteParameters )
	
	StandardButtons.AdjustSaving ( ThisObject, WriteParameters );

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure SenderOnChange ( Item )
	
	setAccount ( Object );
	
EndProcedure

&AtClient
Procedure ReceiverOnChange ( Item )
	
	setAccountTo ( Object );
	
EndProcedure

&AtClient
Procedure CurrencyOnChange ( Item )
	
	applyCurrency ();
	
EndProcedure

&AtServer
Procedure applyCurrency ()

	PaymentForm.SetRates ( Object );
	Appearance.Apply ( ThisObject, "Object.Currency" );

EndProcedure
